<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of ImageAlpha and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.ep.munki.ImageAlpha</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>NAME</key>
			<string>ImageAlpha</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>ImageAlpha greatly reduces file sizes of 24-bit PNG files (including alpha transparency) by applying lossy compression and conversion to a more efficient PNG8+alpha format. Such images are compatible with iOS, all browsers, and even degrade well in IE6.</string>
				<key>display_name</key>
				<string>ImageAlpha</string>
				<key>developer</key>
				<string>ImageAlpha</string>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.3.0</string>
		<key>ParentRecipe</key>
		<string>com.github.ep.pkg.ImageAlpha</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
